testAme/labs/lab7/reactingFlowPasr/system/functionObjects/forces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

forceSplitter
{
		type		forces;
		enabled		yes;
		libs		("libforces.so");
		log		yes;
		patches		("(splitter.*)");
		rho		rhoInf;
		rhoInf		1.18;

		writeControl	runTime;
		writeInterval	0.1;
		writeFormat     binary;
		liftDir		(1 0 0);
		dragDir		(0 1 0);
		CofR			(0 0 0);
}
	
// ***************************************************************************** //
